Dataset/Hashi/31-05-24/15/hotelReservation/2/nomad-hr-wrk-mixed-c6525-25g-exp15-havail1-hori1-verti1-infi1-client-t8-c512-d30-R1000-N2
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=1000
Running 30s test @ http://10.10.1.2:5000
  8 threads and 512 connections
  Thread calibration: mean lat.: 1.679ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.593ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.740ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.674ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.710ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.607ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.620ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.595ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.63ms    1.56ms   5.04ms   96.90%
    Req/Sec   132.02    119.71   444.00     57.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.35ms
 75.000%    1.92ms
 90.000%    2.46ms
 99.000%    5.04ms
 99.900%   23.77ms
 99.990%   33.73ms
 99.999%   34.69ms
100.000%   34.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.391     0.000000            1         1.00
       0.794     0.100000         2001         1.11
       0.923     0.200000         4014         1.25
       1.066     0.300000         6001         1.43
       1.246     0.400000         8006         1.67
       1.350     0.500000        10009         2.00
       1.404     0.550000        11003         2.22
       1.481     0.600000        12003         2.50
       1.635     0.650000        13003         2.86
       1.797     0.700000        14004         3.33
       1.922     0.750000        15000         4.00
       1.994     0.775000        15505         4.44
       2.061     0.800000        16003         5.00
       2.137     0.825000        16501         5.71
       2.227     0.850000        17003         6.67
       2.335     0.875000        17500         8.00
       2.399     0.887500        17751         8.89
       2.461     0.900000        18001        10.00
       2.535     0.912500        18254        11.43
       2.621     0.925000        18506        13.33
       2.745     0.937500        18750        16.00
       2.803     0.943750        18875        17.78
       2.883     0.950000        19004        20.00
       2.965     0.956250        19126        22.86
       3.057     0.962500        19251        26.67
       3.189     0.968750        19377        32.00
       3.259     0.971875        19439        35.56
       3.341     0.975000        19500        40.00
       3.451     0.978125        19563        45.71
       3.611     0.981250        19625        53.33
       3.837     0.984375        19687        64.00
       3.983     0.985938        19718        71.11
       4.267     0.987500        19750        80.00
       4.615     0.989062        19781        91.43
       5.631     0.990625        19812       106.67
       6.791     0.992188        19843       128.00
       7.767     0.992969        19859       142.22
       9.127     0.993750        19875       160.00
      10.775     0.994531        19890       182.86
      12.727     0.995313        19906       213.33
      14.647     0.996094        19921       256.00
      16.399     0.996484        19929       284.44
      16.975     0.996875        19937       320.00
      18.047     0.997266        19945       365.71
      19.215     0.997656        19953       426.67
      20.207     0.998047        19960       512.00
      20.815     0.998242        19964       568.89
      21.487     0.998437        19968       640.00
      22.271     0.998633        19972       731.43
      22.799     0.998828        19976       853.33
      23.919     0.999023        19980      1024.00
      24.319     0.999121        19982      1137.78
      25.647     0.999219        19984      1280.00
      27.791     0.999316        19986      1462.86
      28.991     0.999414        19988      1706.67
      29.167     0.999512        19990      2048.00
      29.231     0.999561        19991      2275.56
      29.695     0.999609        19993      2560.00
      29.695     0.999658        19993      2925.71
      30.287     0.999707        19994      3413.33
      31.311     0.999756        19995      4096.00
      31.311     0.999780        19995      4551.11
      33.247     0.999805        19996      5120.00
      33.247     0.999829        19996      5851.43
      33.727     0.999854        19997      6826.67
      33.727     0.999878        19997      8192.00
      33.727     0.999890        19997      9102.22
      34.175     0.999902        19998     10240.00
      34.175     0.999915        19998     11702.86
      34.175     0.999927        19998     13653.33
      34.175     0.999939        19998     16384.00
      34.175     0.999945        19998     18204.44
      34.687     0.999951        19999     20480.00
      34.687     1.000000        19999          inf
#[Mean    =        1.626, StdDeviation   =        1.564]
#[Max     =       34.656, Total count    =        19999]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29933 requests in 30.01s, 12.38MB read
  Socket errors: connect 0, read 0, write 0, timeout 131
Requests/sec:    997.38
Transfer/sec:    422.32KB